#Lecture 6 Dictonary Dataframe and Panda 
student name: krish        

division : E

Dictionaries

In [4]:
student_1= {"name": "krish",
            "age": 19,
          "division": "E",
          "favorite food": ["pizza","dosa","pav bhaji"],
         "favorite movies": ["ZNMD","gravity"]
          }
student_1

{'age': 19,
 'division': 'E',
 'favorite food': ['pizza', 'dosa', 'pav bhaji'],
 'favorite movies': ['ZNMD', 'gravity'],
 'name': 'krish'}

In [5]:
#print the list of favorite food 
student_1["favorite food"]

['pizza', 'dosa', 'pav bhaji']

In [6]:
#print the division 
student_1["division"]

'E'

In [8]:
#add a new key to favorite songs 
student_1["favorite songs "]=["blinding lights","stargazing","sicko mode"]
student_1

{'age': 19,
 'division': 'E',
 'favorite food': ['pizza', 'dosa', 'pav bhaji'],
 'favorite movies': ['ZNMD', 'gravity'],
 'favorite songs ': ['blinding lights', 'stargazing', 'sicko mode'],
 'name': 'krish'}

In [9]:
#over writing a value 
student_1["division"]="A"
student_1

{'age': 19,
 'division': 'A',
 'favorite food': ['pizza', 'dosa', 'pav bhaji'],
 'favorite movies': ['ZNMD', 'gravity'],
 'favorite songs ': ['blinding lights', 'stargazing', 'sicko mode'],
 'name': 'krish'}

In [10]:
#add a movie to the list 
student_1["favorite movies"].append("race2")
student_1

{'age': 19,
 'division': 'A',
 'favorite food': ['pizza', 'dosa', 'pav bhaji'],
 'favorite movies': ['ZNMD', 'gravity', 'race2'],
 'favorite songs ': ['blinding lights', 'stargazing', 'sicko mode'],
 'name': 'krish'}

In [11]:
#total keys in my dictionary 
total_keys_in_student_1= len(student_1)
total_keys_in_student_1

6

Dataframes and Pandas

In [13]:
#setup 
import pandas as pd

In [12]:
div_scores_dictionary = {"student_name": ["Jay", "Aaryan", "Sahil","Riya","Shubh"],
                         "math_scores": [20,56,76,78,90],
                         "chemistry_scores": [32,36,78,23,100],
                         "information_technology_scores": [34,6,88,100,45],
                         "physics_scores": [6,88,48,90,25]
                         }
                         
div_emails_dictionary = {"student_name": ["Jay", "Aaryan", "Sahil","Riya","Shubh", "Abdul"],
                           "student_email": ["Jay@gmail.com", "Aaryan@gmail.com", "Sahil@gmail.com","Riya@gmail.com","Shubh@gmail.com", "Abdual@gmail.com"]
                         }

In [20]:
#converting the scores dictionary into dataframe
scores_df = pd.DataFrame(div_scores_dictionary)
scores_df

  student_name  math_scores  ...  information_technology_scores  physics_scores
0          Jay           20  ...                             34               6
1       Aaryan           56  ...                              6              88
2        Sahil           76  ...                             88              48
3         Riya           78  ...                            100              90
4        Shubh           90  ...                             45              25

[5 rows x 5 columns]

In [21]:
scores_df.head(3)

  student_name  math_scores  ...  information_technology_scores  physics_scores
0          Jay           20  ...                             34               6
1       Aaryan           56  ...                              6              88
2        Sahil           76  ...                             88              48

[3 rows x 5 columns]

In [22]:
scores_df.sample(3)

  student_name  math_scores  ...  information_technology_scores  physics_scores
2        Sahil           76  ...                             88              48
1       Aaryan           56  ...                              6              88
4        Shubh           90  ...                             45              25

[3 rows x 5 columns]

In [24]:
# add a coloumn called "total_scores"
scores_df["total_scores"]= scores_df['math_scores']+ scores_df['chemistry_scores']+ scores_df['physics_scores']+ scores_df['information_technology_scores']
scores_df

  student_name  math_scores  ...  physics_scores  total_scores
0          Jay           20  ...               6            92
1       Aaryan           56  ...              88           186
2        Sahil           76  ...              48           290
3         Riya           78  ...              90           291
4        Shubh           90  ...              25           260

[5 rows x 6 columns]

In [25]:
#add a coloumn called "average_scores"
scores_df["acerage_scores"]= scores_df["total_scores"]/4
scores_df

  student_name  math_scores  ...  total_scores  acerage_scores
0          Jay           20  ...            92           23.00
1       Aaryan           56  ...           186           46.50
2        Sahil           76  ...           290           72.50
3         Riya           78  ...           291           72.75
4        Shubh           90  ...           260           65.00

[5 rows x 7 columns]

In [27]:
scores_df.describe().transpose().to_csv("report card insights.csv")